#include <Windows.h>
#include <iostream>
#include <string>
#include <iomanip>

using namespace std;

int main ()

{
  	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
std::string name1, name2, name3, r1, r2, r3, nas1, nas2, nas3, sq1, sq2, sq3 ;
/* ¬ведение фактических данных*/
printf("1. ¬вед≥ть: спектральний клас, приблизну масу (в≥дн. —онц€), чатску %, чисельн≥сть ");
getline(cin, name1);
printf("2. ¬вед≥ть: спектральний клас, приблизну масу (в≥дн. —онц€), чатску %, чисельн≥сть ");
getline(cin, name2);
printf("3. ¬вед≥ть: спектральний клас, приблизну масу (в≥дн. —онц€), чатску %, чисельн≥сть ");
getline(cin, name3);
/* ¬иведенн€ таблиц≥ */
/* ¬иведенн€ заголовк≥в */
printf("-----------------------------------------------\n");
printf("|ѕриблизна к-сть з≥рок р≥зних спектральних клас≥в у √алактиц≥ |\n");
printf("|---------------------------------------------|\n");
printf("| —пектральний клас | ѕриблизна маса (в≥дн. —онц€) | „астка % | „исельн≥сть |\n");
printf("|-------------------|------------------------------|----------|-------------|\n");
/* виведенн€ р€дк≥в фактичних даних */
cout << left << setw(11) <<"|"<< setw(11) << name1 <<"|" <<  setw(11) << r1 <<"|" << setw(3) << nas1 <<"|"<< setw(11) << sq1 <<"|" <<endl;
cout << left << setw(11) <<"|"<< name1<<"|"<< r1<<"|"<< nas1<<"|"<< sq1<<"|"<<endl;
cout << left << setw(11) <<"|"<< name2<<"|"<< r2<<"|"<< nas2<<"|"<< sq2<<"|"<<endl;
cout << left << setw(11) <<"|"<< name3<<"|"<< r3<<"|"<< nas3<<"|"<< sq3<<"|"<<endl;

/* виведенн€ прим≥тки */
printf("|---------------------------------------------|\n");
printf("| ѕрим≥тка: не показан≥ дан≥ дл€ клас≥в: B, A, G, K |\n");
printf("-----------------------------------------------\n");
return 0;
}
