#include <Windows.h>
#include <iostream>
#include <string>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main ()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    double chislo;//Створюємо перемінні величини оператора
    cout<<"Скільки буде 5х7 ";//Просто вводимо текст через оператора cout
    cout<<"Введіть відповідь і натисніть <Enter> ";//Просто вводимо текст через оператора cout
	std::cin>>chislo;//Вводимо данні в перемінну
    if (chislo==35){//Створюємо умову для подальшої дії
    cout<<"Правильно "<<endl;//Просто вводимо текст через оператора cout
    } else
	{
    cout<<"Ви помилися. 5х7=35"<<endl;//Просто вводимо текст через оператора cout	
	}	
	return 0;
  	
}
