#include <Windows.h>
#include <iostream>
#include <string>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main ()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    double check,sum,sum1;//Створюємо перемінні величини оператора
	std::cout<<"Введіть ціну ";//Просто вводимо текст через оператора cout
	std::cin >> check;//Вводимо данні в перемінну
  	
  	if (check>=1000){//Створюємо умову для подальшої дії
	  sum=(check*10)/100;//
	  sum1=check-sum;
	  std::cout<<"Вам надана знижка 10%"<<endl;//Просто вводимо текст через оператора cout
	  std::cout<<"Вартісь з урахуваням знижки ";//Просто вводимо текст через оператора cout
	  std::cout<<sum1<<endl;//Просто вводимо текст через оператора cout
	} else {
	cout<<"Вартість покупки ";//Просто вводимо текст через оператора cout
	cout<<check<<endl;//Просто виводимо перемінну через оператора cout
 	}
	  return 0;
  	
}
