#include <Windows.h>
#include <iostream>
#include <string>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main ()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    double inp;//Створюємо перемінні величини оператора
    cout<<"В якому році ствроно факультет ФТІТ ";//Просто вводимо текст через оператора cout
	std::cin>>inp;//Вводимо данні в перемінну
	
    if (inp==2007){//Створюємо умову для подальшої дії
    cout<<"Правильно"<<endl;//Просто вводимо текст через оператора cout
    } else {
    cout<<"Не вірно. Факультет створено у 2007 році"<<endl;//Просто вводимо текст через оператора cout	
	}	
	return 0;
  	
}
