#include <Windows.h>
#include <iostream>
#include <string>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main ()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    double inp, year;//Створюємо перемінні величини оператора
    year=1939;//Вводимо данні в перемінну
    cout<<"У якому році розпочалася друга світова війна?"<<endl;//Просто вводимо текст через оператора cout
    cout<<"Введіть число і натисніть <Enter> ";//Просто вводимо текст через оператора cout
	std::cin>>inp;//Вводимо данні в перемінну
	
    if (inp==year){//Створюємо умову для подальшої дії
    cout<<"Правильно"<<endl;//Просто вводимо текст через оператора cout
    } else {
    cout<<"Неправильно, друга світова війна розпочалася "<<year<<endl;//Просто вводимо текст через оператора cout	
	}	
	return 0;
  	
}
