#include <iostream>
#include <conio.h>
#include <windows.h>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    int N;//Створюємо перемінні величини оператора
    float k;//Створюємо перемінні величини оператора
    cout<<"Програма для перевіки числа на ділене"<<endl;//Просто вводимо текст через оператора cout
    cout<<"Введіть число ";
    cin>>N;//Вводимо данні в перемінну
    k = N / 3;
 
    if(N % 3 ==0)//Створюємо умову для подальшої дії
            cout<<N<<" Ділиться на 3"<<endl;//Просто вводимо текст через оператора cout
    else
            cout<<N<<" Не ділиться"<<endl;//Просто вводимо текст через оператора cout
 
 
getch();  }
