#include<Windows.h>
#include<iostream>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    cout<<"Програма для перевіки числа на парне або не парне"<<endl;//Просто вводимо текст через оператора cout
    cout<<"Введіть будь яке число"<<endl;//Просто вводимо текст через оператора cout
	int a;//Створюємо перемінні величини оператора
	std::cin>>a;//Вводимо данні в перемінну
    if (a % 2 == 0){//Створюємо умову для подальшої дії
    cout<<"Число " <<a<< " парне "<<endl;//Просто вводимо текст через оператора cout
    } 	else
	{
    cout<<"Число " <<a<< " не парне"<<endl;//Просто вводимо текст через оператора cout	
	}	
	return 0;
}
   
