#include <iostream>
#include <Windows.h>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)
 
 //Виконав студент КН-1-2 Грищенко Олександр
 
int main()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    std::cout << "Скільки буде 65-16"<<endl;//Просто вводимо текст через оператора cout
    std::cout<<"Введіть відповідь і натисніть <Enter> ";//Просто вводимо текст через оператора cout
    int chislo;//Створюємо перемінні величини оператора
    std::cin >> chislo;//Вводимо данні в перемінну
    if ( chislo==49 ){//Створюємо умову для подальшої дії 
	
        std::cout << "Правильно";//Просто вводимо текст через оператора cout
    }else if (chislo>100){//Створюємо умову для подальшої дії 
	
        std::cout << "Вам необхідно ввести число не більше ніж 100";//Просто вводимо текст через оператора cout
    } else {
        std::cout << "Неправильно, 65-16=49";//Просто вводимо текст через оператора cout
}
    
}
