#include<iostream>
#include<Windows.h>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
	int n,p,s,q;//Створюємо перемінні величини оператора int
	cout<<"Праграмма для обчислення идеальної ваги"<<endl;//Просто вводимо текст через оператора cout, та закінчеємо строку оператором endl
	cout<<"Будь-ласка введіть свій ріст(см) та вагу(кг)"<<endl;//Просто вводимо текст через оператора cout, та закінчеємо строку оператором endl
	std::cin >> n;//Вводимо данні в перемінну
	std::cin >> p;
	q=(n-100);//Проводимо операцію віднімання чисел
	if (q>=p)//Створюємо умову для подальшої дії
	{
		s=(n-100)-p;//Використовуємо формулу для обчисленя идеальної ваги
		cout<<"Вам слід набрати "<<s<<"кг"<<endl;//Виводимо рекомендацію
	}
	if (q<p)//Умова для скидиня ваги
	{
		s=(n-100)-p;//Використовуємо формулу для обчисленя идеальної ваги
		cout<<"Вам слід скинути "<<s<<"кг"<<endl;//Виводимо рекомендацію
	}
	else//Дана команда використовується як службова та не виводить данні
	cout<<""<<endl;
}
