#include <iostream>
#include <windows.h>
using namespace std;//Виставляємо робоче иісце для роботи команд(cin,cout)

//Виконав студент КН-1-2 Грищенко Олександр

int main()
{
	SetConsoleCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    SetConsoleOutputCP(1251);//Встановлюємо каодуваня 1251 для відображення кирилиці
    double sum, sum1,sq, xv, rozmova,den;//Створюємо перемінні величини оператора
    rozmova=0.72;//Вводимо данні в перемінну
    cout<<"Вітаємо вас в програмі обчисленя знижки за розмову"<<endl;//Просто вводимо текст через оператора cout
    cout<<"Введіть кількість цілих хвилин"<<endl;//Просто вводимо текст через оператора cout
    std::cin >> xv;//Вводимо данні в перемінну
    cout<<"Введіть день в форматі (Будній день = 1 , Вихідний день = 2)"<<endl;//Просто вводимо текст через оператора cout
    std::cin >> den;//Вводимо данні в перемінну
    if (den==2)//Створюємо умову для подальшої дії
    {
    	if (xv-(int)xv==0)//Перевіряємо чи ціле число ввели
    	{
    		sq=xv*rozmova;
			sum=(xv*20)/100;
	  		sum1=sq-sum;
	  		
	  		cout<<"Вам надано знижку 20% за дзвінок"<<endl;//Просто вводимо текст через оператора cout
	  		cout<<"Вартість дзвінка з урахуванням знижки "<<sum1<<"грн"<<endl;//Просто вводимо текст через оператора cout
	  	
	  	}
	  	else 
	  	{
	  		cout<<"Неправильний ввід хвилин!!"<<endl;//Просто вводимо текст через оператора cout
	  		cout<<"Спробуйте ще раз"<<endl;//Просто вводимо текст через оператора cout
		}
	}
	else 
	{
		sq=xv*rozmova;
		cout<<"Знижка за двінок в будній день не надаеться"<<endl;//Просто вводимо текст через оператора cout
		cout<<"Вартість дзвінка "<<sq<<"грн"<<endl;//Просто вводимо текст через оператора cout
		
	}
}
